## Extra Exercises 1

In [1]:
import numpy as np
import pandas as pd

</br>

#### 1. Combine multiple series to form a DataFrame

In [2]:
series1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
series2 = pd.Series(np.arange(26))

In [12]:
#Answer:
df = pd.DataFrame({'A':series1,'B':series2})
df.head(26)

    A   B
0   a   0
1   b   1
2   c   2
3   e   3
4   d   4
5   f   5
6   g   6
7   h   7
8   i   8
9   j   9
10  k  10
11  l  11
12  m  12
13  n  13
14  o  14
15  p  15
16  q  16
17  r  17
18  s  18
19  t  19
20  u  20
21  v  21
22  w  22
23  x  23
24  y  24
25  z  25

**Extra**: Create a third series and combine the three. What happens if one series is a different length?

In [21]:
series3 = pd.Series(np.arange(10))
df['C'] = series3
df.head(30)

    A   B    C
0   a   0  0.0
1   b   1  1.0
2   c   2  2.0
3   e   3  3.0
4   d   4  4.0
5   f   5  5.0
6   g   6  6.0
7   h   7  7.0
8   i   8  8.0
9   j   9  9.0
10  k  10  NaN
11  l  11  NaN
12  m  12  NaN
13  n  13  NaN
14  o  14  NaN
15  p  15  NaN
16  q  16  NaN
17  r  17  NaN
18  s  18  NaN
19  t  19  NaN
20  u  20  NaN
21  v  21  NaN
22  w  22  NaN
23  x  23  NaN
24  y  24  NaN
25  z  25  NaN

</br>

#### 2. Keep only top 2 most frequent values as it is and replace everything else as 'Other'

In [20]:
np.random.seed(42)
series = pd.Series(np.random.randint(1, 5, [12]))

In [72]:
#Answer:
value_count = series.value_counts()
print(value_count)
top_two = value_count[:2]
print(value_count[:1])

3    6
1    3
4    2
2    1
Name: count, dtype: int64
3    6
Name: count, dtype: int64

**Extra**: Do the same but for the highest and lowest value count, replacing everything else as other.

</br>

#### 3. Extract items at given positions from a series

In [8]:
series = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
positions = [0, 4, 8, 14, 20]

In [ ]:
#Answer:

</br>

#### 4. Compute differences between consecutive numbers of a series

**Desired Output**: [nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]

In [ ]:
series = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

In [11]:
#Answer:

**Extra**: Find the cumulative sum of the series instead of the differences. </br>
**Desired Output**: [1, 4, 10, 20, 35, 56, 83, 118]

</br>

#### 5. String Manipulation

Have the user enter a string and write a function that capitalizes the first letter of each word.

In [20]:
#Answer:

**Extra**: Print out the count of the number of words in the string.

</br>

#### 6. Extracting Data

In [12]:
data = [
    {
        "id": 1,
        "name": "John",
        "department": ["HR", "New York"],
        "skills": ["communication", "teamwork", "leadership"]
    },
    {
        "id": 2,
        "name": "Jane",
        "department": ["Finance", "San Francisco"],
        "skills": ["accounting", "analysis"]
    },
    {
        "id": 3,
        "name": "Michael",
        "department": ["Engineering", "Seattle"],
        "skills": ["programming", "problem-solving"]
    },
    {
        "id": 4,
        "name": "Sarah",
        "department": ["Marketing", "Los Angeles"],
        "skills": ["marketing", "creativity"]
    },
    {
        "id": 5,
        "name": "David",
        "department": ["Sales", "Chicago"],
        "skills": ["sales", "negotiation"]
    },
    {
        "id": 6,
        "name": "Emily",
        "department": ["Engineering", "Seattle"],
        "skills": ["coding", "troubleshooting"]
    }
]

##### A. Extract all employee names

In [13]:
#Answer:

##### B. Find the department of employee with ID 4

In [14]:
#Answer:

##### C. Count the number of employees in each department

In [15]:
#Answer:

##### D. Find the names of employees in the "Engineering" department

In [16]:
#Answer:

##### E. Extract names of employees with skills including "Programming"

In [17]:
#Answer:

##### F. Calculate the average number of skills per employee

In [18]:
#Answer:

##### G. Find the employee with the most skills

In [19]:
#Answer: